{"_id": "65483c41dbce6bd2be2db9d8", "id": "SeifGad/New_Classifier", "private": false, "pipeline_tag": "feature-extraction", "library_name": "transformers", "tags": ["transformers", "safetensors", "bert", "feature-extraction", "text-embeddings-inference", "endpoints_compatible", "region:us"], "downloads": 3, "likes": 0, "modelId": "SeifGad/New_Classifier", "author": "SeifGad", "sha": "d545719033316179b3b59b26ba544971fddfe8e2", "lastModified": "2023-11-06T01:07:38.000Z", "gated": false, "disabled": false, "mask_token": "[MASK]", "config": {"architectures": ["BertModel"], "model_type": "bert", "tokenizer_config": {"cls_token": "[CLS]", "mask_token": "[MASK]", "pad_token": "[PAD]", "sep_token": "[SEP]", "unk_token": "[UNK]"}}, "transformersInfo": {"auto_model": "AutoModel", "pipeline_tag": "feature-extraction", "processor": "AutoTokenizer"}, "siblings": [{"rfilename": ".gitattributes"}, {"rfilename": "config.json"}, {"rfilename": "model.safetensors"}, {"rfilename": "special_tokens_map.json"}, {"rfilename": "tokenizer.json"}, {"rfilename": "tokenizer_config.json"}, {"rfilename": "vocab.txt"}], "spaces": [], "createdAt": "2023-11-06T01:07:13.000Z", "safetensors": {"parameters": {"F32": 109482240}, "total": 109482240}, "usedStorage": 437951328, "downloadsAllTime": 15, "inferenceProviderMapping": {}, "configJson": {"_name_or_path": "/content/Classifier_newest", "architectures": ["BertModel"], "attention_probs_dropout_prob": 0.1, "classifier_dropout": null, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 768, "initializer_range": 0.02, "input_layers": [["agent_txt_inputids", 0, 0], ["agent_txt_mask", 0, 0]], "intermediate_size": 3072, "layer_norm_eps": 1e-12, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "int32", "name": "agent_txt_inputids", "ragged": false, "sparse": false}, "inbound_nodes": [], "module": "keras.layers", "name": "agent_txt_inputids", "registered_name": null}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "int32", "name": "agent_txt_mask", "ragged": false, "sparse": false}, "inbound_nodes": [], "module": "keras.layers", "name": "agent_txt_mask", "registered_name": null}, {"build_config": {"input_shape": [1, 2]}, "class_name": "TFBertMainLayer", "config": {"config": {"_name_or_path": "omarelsayeed/tsdae_small_40mb", "_num_labels": 2, "add_cross_attention": false, "architectures": ["BertModel"], "attention_probs_dropout_prob": 0.1, "bad_words_ids": null, "begin_suppress_tokens": null, "bos_token_id": null, "chunk_size_feed_forward": 0, "classifier_dropout": null, "cross_attention_hidden_size": null, "decoder_start_token_id": null, "diversity_penalty": 0.0, "do_sample": false, "early_stopping": false, "encoder_no_repeat_ngram_size": 0, "eos_token_id": null, "exponential_decay_length_penalty": null, "finetuning_task": null, "forced_bos_token_id": null, "forced_eos_token_id": null, "gradient_checkpointing": false, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 256, "id2label": {"0": "اماكن فروع فوري", "1": "مواعيد فروع فوري", "10": "حساب جديد", "11": "تسجيل دخول حساب", "12": "حذف حساب", "13": "حساب محظور", "14": "تحديث حساب", "15": "طباعه فاتورة", "16": "استفسار عن حالة العملية/العملية اتخصمت", "17": "شراء ماكينه", "18": "تحويل مبلغ مالي", "19": "خدمات القوات المسلحة", "2": "وظيفة", "20": "شحن الموبايل", "21": "فاتورة الموبايل", "22": "مياه", "23": "غاز", "24": "الكهرباء", "25": "فوري باي", "26": "شحن كارت الكهرباء", "27": "شحن كارت المياه", "28": "مشكلة في التطبيق", "29": "استراجع قيمة مالية", "3": "مخالفات المرور", "30": "معاملات دولية", "31": "تذاكر", "32": "التأمين", "33": "النقابات", "34": "تعليم", "35": "خدمة العملاء", "36": "العاب اونلاين", "37": "معاملات مالية و بنوك", "38": "تمويل متناهي الصغر", "39": "مدفوعات اونلاين", "4": "استلام الرخصة", "40": "تبرعات", "41": "اشتراك نوادي", "42": "Yellow Card", "43": "جوائز", "44": "شحن كارت الغاز", "45": "الانترنت المنزلي", "46": "التليفون الأرضي", "47": "فوري تقسيط", "48": "فوري يومي", "49": "تقديم شكوي", "5": "تجديد الرخصة", "50": "سكن وعقارات", "51": "فوري للوساطة التأمينية", "52": "تأمين اجتماعي", "53": "ايداع", "54": "Consumer Finance", "55": "تسجيل الوحدات العقارية", "56": "سحب", "57": "شراء من محل", "6": "اضافه كارت", "7": "حذف كارت", "8": "تخطى حد مسموح", "9": "بطاقه معلقة/البطاقة محظورة"}, "initializer_range": 0.02, "intermediate_size": 1024, "is_decoder": false, "is_encoder_decoder": false, "label2id": {"Consumer Finance": 54, "Yellow Card": 42, "استراجع قيمة مالية": 29, "استفسار عن حالة العملية/العملية اتخصمت": 16, "استلام الرخصة": 4, "اشتراك نوادي": 41, "اضافه كارت": 6, "الانترنت المنزلي": 45, "التأمين": 32, "التليفون الأرضي": 46, "العاب اونلاين": 36, "الكهرباء": 24, "النقابات": 33, "اماكن فروع فوري": 0, "ايداع": 53, "بطاقه معلقة/البطاقة محظورة": 9, "تأمين اجتماعي": 52, "تبرعات": 40, "تجديد الرخصة": 5, "تحديث حساب": 14, "تحويل مبلغ مالي": 18, "تخطى حد مسموح": 8, "تذاكر": 31, "تسجيل الوحدات العقارية": 55, "تسجيل دخول حساب": 11, "تعليم": 34, "تقديم شكوي": 49, "تمويل متناهي الصغر": 38, "جوائز": 43, "حذف حساب": 12, "حذف كارت": 7, "حساب جديد": 10, "حساب محظور": 13, "خدمات القوات المسلحة": 19, "خدمة العملاء": 35, "سحب": 56, "سكن وعقارات": 50, "شحن الموبايل": 20, "شحن كارت الغاز": 44, "شحن كارت الكهرباء": 26, "شحن كارت المياه": 27, "شراء ماكينه": 17, "شراء من محل": 57, "طباعه فاتورة": 15, "غاز": 23, "فاتورة الموبايل": 21, "فوري باي": 25, "فوري تقسيط": 47, "فوري للوساطة التأمينية": 51, "فوري يومي": 48, "مخالفات المرور": 3, "مدفوعات اونلاين": 39, "مشكلة في التطبيق": 28, "معاملات دولية": 30, "معاملات مالية و بنوك": 37, "مواعيد فروع فوري": 1, "مياه": 22, "وظيفة": 2}, "layer_norm_eps": 1e-12, "length_penalty": 1.0, "max_length": 20, "max_position_embeddings": 512, "min_length": 0, "model_type": "bert", "no_repeat_ngram_size": 0, "num_attention_heads": 4, "num_beam_groups": 1, "num_beams": 1, "num_hidden_layers": 4, "num_return_sequences": 1, "output_attentions": true, "output_hidden_states": true, "output_past": true, "output_scores": false, "pad_token_id": 0, "position_embedding_type": "absolute", "prefix": null, "problem_type": "single_label_classification", "pruned_heads": {}, "remove_invalid_values": false, "repetition_penalty": 1.0, "return_dict": true, "return_dict_in_generate": false, "sep_token_id": null, "suppress_tokens": null, "task_specific_params": null, "temperature": 1.0, "tf_legacy_loss": false, "tie_encoder_decoder": false, "tie_word_embeddings": true, "tokenizer_class": null, "top_k": 50, "top_p": 1.0, "torch_dtype": "float32", "torchscript": false, "transformers_version": "4.35.0", "type_vocab_size": 2, "typical_p": 1.0, "use_bfloat16": false, "use_cache": true, "vocab_size": 32000}, "dtype": "float32", "name": "bert", "trainable": true}, "inbound_nodes": [[["agent_txt_inputids", 0, 0, {"attention_mask": ["agent_txt_mask", 0, 0]}]]], "module": "transformers.models.bert.modeling_tf_bert", "name": "bert", "registered_name": "Custom>TFBertMainLayer"}, {"build_config": {"input_shape": [null, 256, 256]}, "class_name": "Sequential", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256], "dtype": "float32", "name": "encoder_input", "ragged": false, "sparse": false}}, {"class_name": "Bidirectional", "config": {"dtype": "float32", "layer": {"class_name": "GRU", "config": {"activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}, "module": "keras.initializers", "registered_name": null}, "bias_regularizer": null, "dropout": 0.0, "dtype": "float32", "go_backwards": false, "implementation": 2, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "module": "keras.initializers", "registered_name": null}, "kernel_regularizer": null, "name": "gru_1", "recurrent_activation": "sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "module": "keras.initializers", "registered_name": null}, "recurrent_regularizer": null, "reset_after": true, "return_sequences": true, "return_state": false, "stateful": false, "time_major": false, "trainable": true, "units": 64, "unroll": false, "use_bias": true}, "module": "keras.layers", "registered_name": null}, "merge_mode": "concat", "name": "encoder", "trainable": true}}, {"class_name": "GlobalMaxPooling1D", "config": {"data_format": "channels_last", "dtype": "float32", "keepdims": false, "name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}, "module": "keras.initializers", "registered_name": null}, "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "module": "keras.initializers", "registered_name": null}, "kernel_regularizer": null, "name": "dense_1", "trainable": true, "units": 128, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "dtype": "float32", "name": "activation_2", "trainable": true}}], "name": "sequential_1"}, "inbound_nodes": [[["bert", 0, 7, {}]]], "module": "keras", "name": "sequential_1", "registered_name": null}, {"build_config": {"input_shape": [null, 128]}, "class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}, "module": "keras.initializers", "registered_name": null}, "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "module": "keras.initializers", "registered_name": null}, "kernel_regularizer": null, "name": "fully_connected_1", "trainable": true, "units": 64, "use_bias": true}, "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "module": "keras.layers", "name": "fully_connected_1", "registered_name": null}, {"build_config": {"input_shape": [null, 64]}, "class_name": "BatchNormalization", "config": {"axis": [1], "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}, "module": "keras.initializers", "registered_name": null}, "beta_regularizer": null, "center": true, "dtype": "float32", "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}, "module": "keras.initializers", "registered_name": null}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "module": "keras.initializers", "registered_name": null}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "module": "keras.initializers", "registered_name": null}, "name": "batch_norm_1", "scale": true, "trainable": true}, "inbound_nodes": [[["fully_connected_1", 0, 0, {}]]], "module": "keras.layers", "name": "batch_norm_1", "registered_name": null}, {"build_config": {"input_shape": [null, 64]}, "class_name": "Activation", "config": {"activation": "elu", "dtype": "float32", "name": "activation_3", "trainable": true}, "inbound_nodes": [[["batch_norm_1", 0, 0, {}]]], "module": "keras.layers", "name": "activation_3", "registered_name": null}, {"build_config": {"input_shape": [null, 64]}, "class_name": "Dropout", "config": {"dtype": "float32", "name": "dropout_1", "noise_shape": null, "rate": 0.2, "seed": null, "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "module": "keras.layers", "name": "dropout_1", "registered_name": null}, {"build_config": {"input_shape": [null, 64]}, "class_name": "Dense", "config": {"activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}, "module": "keras.initializers", "registered_name": null}, "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "module": "keras.initializers", "registered_name": null}, "kernel_regularizer": null, "name": "output_layer", "trainable": true, "units": 51, "use_bias": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "module": "keras.layers", "name": "output_layer", "registered_name": null}], "max_position_embeddings": 512, "model_type": "bert", "name": "model_1", "num_attention_heads": 12, "num_hidden_layers": 12, "output_layers": [["output_layer", 0, 0]], "pad_token_id": 0, "position_embedding_type": "absolute", "torch_dtype": "float32", "trainable": true, "transformers_version": "4.35.0", "type_vocab_size": 2, "use_cache": true, "vocab_size": 30522}, "onnxFiles": {}, "safetensorsSizeMb": 438.0, "approxSizeMb": 437.9, "fetchedAt": "2026-06-11T08:11:04.000Z"}